cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'autoconf'
brew 'automake'
# brew 'chromedriver'
brew 'elasticsearch'
brew 'ffmpeg', args: [
  'with-fdk-aac',
  'with-ffplay',
  'with-freetype',
  'with-libass',
  'with-libquvi',
  'with-libvorbis',
  'with-libvpx',
  'with-opus',
  'with-theora',
  'with-x265'
]
brew 'figlet'
brew 'fontconfig'
brew 'freetype'
brew 'fribidi'
brew 'git-flow'
brew 'go'
brew 'gpg'
brew 'graphviz'
brew 'guetzli'
brew 'hub'
brew 'httpd'
brew 'imagemagick'
brew 'jq'
brew 'lame'
brew 'libass'
brew 'libgpg-error'
brew 'libiconv'
brew 'libksba'
brew 'libogg'
brew 'libpng'
brew 'libquvi'
brew 'libtool'
brew 'libvo-aacenc'
brew 'libvorbis'
brew 'libvpx'
brew 'libyaml'
brew 'lolcat'
brew 'lua'
brew 'magic-wormhole'
brew 'mysql'
brew 'nvm'
brew 'openldap'
brew 'openssl'
brew 'php'
brew 'piknik'
brew 'pkg-config'
brew 'postgres'
brew 'pv'
brew 'python'
brew 'qtfaststart'
brew 'readline'
brew 'redis'
brew 's3cmd'
brew 'sdl'
brew 'texi2html'
brew 'theora'
brew 'vim'
brew 'wget'
brew 'x264'
brew 'xvid'
brew 'yasm'
brew 'zsh'
brew 'zsh-completions'
brew 'zstd'

cask 'air-video-server-hd'
cask 'alfred'
cask 'atom'
cask 'cyberduck'
# cask 'docker-toolbox'
cask 'divvy'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'harvest'
cask 'hex-fiend'
cask 'java'
cask 'ngrok'
cask 'openoffice'
cask 'owncloud'
cask 'postman'
cask 'homebrew/cask-versions/sequel-pro-nightly'
cask 'sketch'
cask 'skype'
cask 'slack'
cask 'soapui'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'tunnelblick'
cask 'unetbootin'
cask 'vlc'
cask 'wireshark'
cask 'zeplin'

# Quick Look Plugins
# see https://github.com/sindresorhus/quick-look-plugins for more info
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-csv'
cask 'quicklook-json'
