cask_args appdir: "/Applications"

tap "homebrew/bundle"

brew "antidote"
brew "chezmoi"
brew "gh"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "gitleaks"
brew "jq"
brew "mkcert"
brew "php"
brew "pipx"
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "wget"
brew "zsh"
brew "zsh-completions"

cask "balenaetcher"
cask "claude"
cask "claude-code"

# The OpenAI updater may install ChatGPT before Homebrew manages it. Avoid an
# interactive administrator prompt when that existing app is already usable.
chatgpt_is_installed = File.exist?("/Applications/ChatGPT.app")
chatgpt_is_managed =
  Dir.exist?("/opt/homebrew/Caskroom/chatgpt") ||
  Dir.exist?("/usr/local/Caskroom/chatgpt")
cask "chatgpt" unless chatgpt_is_installed && !chatgpt_is_managed

cask "codex"
cask "copilot-cli"
cask "cyberduck"
cask "docker-desktop"
cask "google-chrome"
cask "ngrok"
cask "owncloud"
cask "postman"
cask "readdle-spark"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "tunnelblick"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# Quick Look extension still available through Homebrew.
cask "qlmarkdown"
