bmewburn.vscode-intelephense-client
browserstackcom.browserstack-vscode
christian-kohler.npm-intellisense
coolbear.systemd-unit-file
cpylua.language-postcss
docker.docker
eamodio.gitlens
ecmel.vscode-html-css
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
github.vscode-github-actions
graphql.vscode-graphql
graphql.vscode-graphql-execution
graphql.vscode-graphql-syntax
hollowtree.vue-snippets
mikestead.dotenv
mrmlnc.vscode-apache
ms-azuretools.vscode-containers
ms-dotnettools.vscode-dotnet-runtime
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.powershell
redhat.vscode-commons
redhat.vscode-yaml
shopify.ruby-lsp
svelte.svelte-vscode
sysoev.language-stylus
twxs.cmake
vayan.haml
vue.volar
wakatime.vscode-wakatime
whatwedo.twig
william-voyek.vscode-nginx
xdebug.php-debug
